<script>
  
</script>

<div class="message__container">
  <h1>Καλωσήρθατε στην εφαρμογή μας</h1>

  <p>
    Εδώ θα μπορείτε να εξερευνήσετε μια χειροποίητη και προσεκτικά 
    σχεδιασμένη βάση δεδομένων που περιέχει μια πληθώρα ελληνικών συνωνύμων.
  </p>

  <h2>Οδηγίες Χρήσης</h2>

  <ul>
    <li>
      Αναζητήστε λέξεις στην παραπάνη μπάρα. Ο σύνθετος αλγόριθμος μας θα προσπαθήσει
      να κάνει τις απαραίτητες διορθώσεις και θα σας παρουσιάσει τα συνώνυμα.
    </li>

    <li>
      Τα ρήματα πρέπει να γράφονται στο πρώτο ενικό και τα επίθετο στο αρσενικό γένος.
      (π.χ. Τρέχω, Ανυπόμονος, Διαγράφω)
    </li>

    <li>
      Μπορείτε να αποθηκεύσετε λέξεις ή να δείτε τον ορισμό του, κάνοντας κλικ
      ή πατώντας (για κινητά) πάνω στα συνώνυμα που βλέπετε.
    </li>
  </ul>
</div>

<style>
  .message__container {
    padding: 0 var(--padding-x);

    max-width: 400px;
    margin: 0 auto;

    margin-top: 3em;
  }

  h1 {
    font-size: 1.2rem;
    margin-bottom: 1em;
  }

  h2 {
    font-size: 0.9rem;

    margin-top: 3em;
    margin-bottom: 1em;
  }

  ul {
    margin-left: 2.5em;
  }

  li {
    margin-bottom: 1em;
  }

  p, li {
    font-size: 0.8rem;
    line-height: 1.3em;
  }
</style>
